In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv("Bengaluru_House_Data.csv")

In [3]:
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.00

In [4]:
df["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', nan, '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [5]:
df["size"]=df["size"].str.replace(" BHK","")

In [6]:
df["size"].unique()

array(['2', '4 Bedroom', '3', '4', '6 Bedroom', '3 Bedroom', '1', '1 RK',
       '1 Bedroom', '8 Bedroom', '2 Bedroom', '7 Bedroom', '5', '7', '6',
       '5 Bedroom', '11', '9', nan, '9 Bedroom', '27', '10 Bedroom',
       '11 Bedroom', '10', '19', '16', '43 Bedroom', '14', '8',
       '12 Bedroom', '13', '18 Bedroom'], dtype=object)

In [7]:
df["size"]=df["size"].str.replace(" Bedroom","")

In [8]:
df["size"].unique()

array(['2', '4', '3', '6', '1', '1 RK', '8', '7', '5', '11', '9', nan,
       '27', '10', '19', '16', '43', '14', '12', '13', '18'], dtype=object)

In [9]:
df["size"]=df["size"].str.replace(" RK","")

In [10]:
df["size"].unique()

array(['2', '4', '3', '6', '1', '8', '7', '5', '11', '9', nan, '27', '10',
       '19', '16', '43', '14', '12', '13', '18'], dtype=object)

In [11]:
df["size"]=df["size"].fillna("1")

In [12]:
df["size"].unique()

array(['2', '4', '3', '6', '1', '8', '7', '5', '11', '9', '27', '10',
       '19', '16', '43', '14', '12', '13', '18'], dtype=object)

In [13]:
df["size"]=df["size"].astype("int")

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13320 non-null  int64
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), int64(1), object(5)
memory usage: 936.7+ KB

In [15]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2,NaN,1200,2.0,1.0,51.00

In [16]:
df["society"].unique()

array(['Coomee ', 'Theanmp', nan, ..., 'SJovest', 'ThhtsV ', 'RSntsAp'],
      dtype=object)

In [17]:
df.isnull().sum()

area_type          0
availability       0
location           1
size               0
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [18]:
df["society"]=df["society"].ffill()

In [19]:
df.isnull().sum()

area_type         0
availability      0
location          1
size              0
society           0
total_sqft        0
bath             73
balcony         609
price             0
dtype: int64

In [20]:
df["total_sqft"].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [21]:
df["total_sqft"]

0        1056
1        2600
2        1440
3        1521
4        1200
         ...
13315    3453
13316    3600
13317    1141
13318    4689
13319     550
Name: total_sqft, Length: 13320, dtype: object

In [36]:
def covert_single(x):
    lst=x.split("-")
    if len(lst)==2:
        return (float(lst[0])+float(lst[1]))/2
    try:
        return float(x)
    except:
        return np.nan

In [34]:
df.drop(columns=["sq_feet"],inplace=True)

In [37]:
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3,Theanmp,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2,Soiewre,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4,ArsiaEx,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1,SollyCl,550,1.0,1.0,17.00

In [38]:
df["new_sqft"]=df["total_sqft"].apply(covert_single)

In [39]:
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price,new_sqft
0,Super built-up Area,19-Dec,Electronic City Phase II,2,Coomee,1056,2.0,1.0,39.07,1056.0
1,Plot Area,Ready To Move,Chikka Tirupathi,4,Theanmp,2600,5.0,3.0,120.00,2600.0
2,Built-up Area,Ready To Move,Uttarahalli,3,Theanmp,1440,2.0,3.0,62.00,1440.0
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3,Soiewre,1521,3.0,1.0,95.00,1521.0
4,Super built-up Area,Ready To Move,Kothanur,2,Soiewre,1200,2.0,1.0,51.00,1200.0
...,...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5,ArsiaEx,3453,4.0,0.0,231.00,3453.0
13316,Super built-up Area,Ready To Move,Richards Town,4,ArsiaEx,3600,5.0,NaN,400.00,3600.0
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2,Mahla T,1141,2.0,1.0,60.00,1141.0
13318,Super built-up Area,18-Jun,Padmanabhanagar,4,SollyCl,4689,4.0,1.0,488.00,4689.0
13319,Super built-up Area,Ready To Move,Doddathoguru,1,SollyCl,550,1.0,1.0,17.00,550.0

In [40]:
df["new_sqft"].unique()

array([1056. , 2600. , 1440. , ..., 1258.5,  774. , 4689. ])

In [41]:
df.isnull().sum()

area_type         0
availability      0
location          1
size              0
society           0
total_sqft        0
bath             73
balcony         609
price             0
new_sqft         46
dtype: int64

In [42]:
df["new_sqft"]=df["new_sqft"].fillna(np.mean(df["new_sqft"]))

In [43]:
df.isnull().sum()

area_type         0
availability      0
location          1
size              0
society           0
total_sqft        0
bath             73
balcony         609
price             0
new_sqft          0
dtype: int64

In [44]:
df.drop(columns=["total_sqft"],inplace=True)

In [45]:
df

,area_type,availability,location,size,society,bath,balcony,price,new_sqft
0,Super built-up Area,19-Dec,Electronic City Phase II,2,Coomee,2.0,1.0,39.07,1056.0
1,Plot Area,Ready To Move,Chikka Tirupathi,4,Theanmp,5.0,3.0,120.00,2600.0
2,Built-up Area,Ready To Move,Uttarahalli,3,Theanmp,2.0,3.0,62.00,1440.0
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3,Soiewre,3.0,1.0,95.00,1521.0
4,Super built-up Area,Ready To Move,Kothanur,2,Soiewre,2.0,1.0,51.00,1200.0
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5,ArsiaEx,4.0,0.0,231.00,3453.0
13316,Super built-up Area,Ready To Move,Richards Town,4,ArsiaEx,5.0,NaN,400.00,3600.0
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2,Mahla T,2.0,1.0,60.00,1141.0
13318,Super built-up Area,18-Jun,Padmanabhanagar,4,SollyCl,4.0,1.0,488.00,4689.0
13319,Super built-up Area,Ready To Move,Doddathoguru,1,SollyCl,1.0,1.0,17.00,550.0

In [46]:
df.head(3)

,area_type,availability,location,size,society,bath,balcony,price,new_sqft
0,Super built-up Area,19-Dec,Electronic City Phase II,2,Coomee,2.0,1.0,39.07,1056.0
1,Plot Area,Ready To Move,Chikka Tirupathi,4,Theanmp,5.0,3.0,120.00,2600.0
2,Built-up Area,Ready To Move,Uttarahalli,3,Theanmp,2.0,3.0,62.00,1440.0

In [49]:
df["bath"].unique()

array([ 2.,  5.,  3.,  4.,  6.,  1.,  9., nan,  8.,  7., 11., 10., 14.,
       27., 12., 16., 40., 15., 13., 18.])

In [50]:
df["bath"]=df["bath"].ffill()

In [51]:
df["bath"]=df["bath"].astype("int")

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13320 non-null  int64
 4   society       13320 non-null  object
 5   bath          13320 non-null  int64
 6   balcony       12711 non-null  float64
 7   price         13320 non-null  float64
 8   new_sqft      13320 non-null  float64
dtypes: float64(3), int64(2), object(4)
memory usage: 936.7+ KB

In [53]:
df["balcony"]=df["balcony"].ffill()

In [54]:
df["balcony"]=df["balcony"].astype("int")

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13320 non-null  int64
 4   society       13320 non-null  object
 5   bath          13320 non-null  int64
 6   balcony       13320 non-null  int64
 7   price         13320 non-null  float64
 8   new_sqft      13320 non-null  float64
dtypes: float64(2), int64(3), object(4)
memory usage: 936.7+ KB

In [56]:
np.max(df["bath"])

40

In [57]:
df=df[df["bath"]<=4]

In [58]:
df

,area_type,availability,location,size,society,bath,balcony,price,new_sqft
0,Super built-up Area,19-Dec,Electronic City Phase II,2,Coomee,2,1,39.07,1056.0
2,Built-up Area,Ready To Move,Uttarahalli,3,Theanmp,2,3,62.00,1440.0
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3,Soiewre,3,1,95.00,1521.0
4,Super built-up Area,Ready To Move,Kothanur,2,Soiewre,2,1,51.00,1200.0
5,Super built-up Area,Ready To Move,Whitefield,2,DuenaTa,2,1,38.00,1170.0
...,...,...,...,...,...,...,...,...,...
13314,Super built-up Area,Ready To Move,Green Glen Layout,3,SoosePr,3,3,112.00,1715.0
13315,Built-up Area,Ready To Move,Whitefield,5,ArsiaEx,4,0,231.00,3453.0
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2,Mahla T,2,1,60.00,1141.0
13318,Super built-up Area,18-Jun,Padmanabhanagar,4,SollyCl,4,1,488.00,4689.0
13319,Super built-up Area,Ready To Move,Doddathoguru,1,SollyCl,1,1,17.00,550.0

In [59]:
df.isnull().sum()

area_type       0
availability    0
location        1
size            0
society         0
bath            0
balcony         0
price           0
new_sqft        0
dtype: int64

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12277 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     12277 non-null  object
 1   availability  12277 non-null  object
 2   location      12276 non-null  object
 3   size          12277 non-null  int64
 4   society       12277 non-null  object
 5   bath          12277 non-null  int64
 6   balcony       12277 non-null  int64
 7   price         12277 non-null  float64
 8   new_sqft      12277 non-null  float64
dtypes: float64(2), int64(3), object(4)
memory usage: 959.1+ KB

In [61]:
df1=pd.read_csv("titanic.csv")

In [62]:
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [64]:
df1.drop(columns=["PassengerId"],inplace=True)

In [65]:
df1

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [67]:
df1.drop(columns=["Name"],inplace=True)

In [68]:
df1

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [69]:
df1.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [71]:
df1["Age"]=df1["Age"].fillna(np.median(df1["Age"]))

In [72]:
df1

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,0,3,male,32.0,0,0,370376,7.7500,NaN,Q